package gr.cite.gaap.utilities;

public class StringUtils 
{

	public static String normalizeEntityName(String input)
	{
		return org.apache.commons.lang.StringUtils.replaceEach(input, new String[]{
				"α", "ά", "β", "γ", "δ", "ε", "έ", "ζ", "η", "ή", "θ", "ι", "ί", "ϊ", "ΐ", "κ", "λ", "μ", 
				"ν", "ξ", "ο", "ό", "π", "ρ", "σ", "τ", "υ", "ύ", "ϋ", "ΰ", "φ", "χ", "ψ", "ω", "ώ", "ς",
				"Α", "Ά", "Β", "Γ", "Δ", "Ε", "Έ", "Ζ", "Η", "Ή", "Θ", "Ι", "Ί", "Ϊ", "Κ", "Λ", "Μ",
				"Ν", "Ξ", "Ο", "Ό", "Π", "Ρ", "Σ", "Τ", "Υ", "Ύ", "Φ", "Χ", "Ψ", "Ω", "Ώ", "Σ",
				" ", "\t", "/", "!", "@", "#", "$", "%", "^"}, new String[]{
				"a", "a", "b", "g", "d", "e", "e", "z", "i", "i", "th", "i", "i", "i", "i", "k", "l", "m",
				"n", "ks", "o", "o", "p", "r", "s", "t", "y", "y", "y", "y", "f", "x", "ps", "o", "o", "s",
				"A", "A", "B", "G", "D", "E", "E", "Z", "I", "I", "TH", "I", "I", "I", "K", "L", "M",
				"N", "KS", "O", "O", "P", "R", "S", "T", "Y", "Y", "F", "X", "PS", "O", "O", "S",
				"_", "_", "_", "", "", "", "", "", ""});
	}
	
	public static String normalizeEntityNameForMV(String input){
		return org.apache.commons.lang.StringUtils.replaceEach(input, new String[]{
				"α", "ά", "β", "γ", "δ", "ε", "έ", "ζ", "η", "ή", "θ", "ι", "ί", "ϊ", "ΐ", "κ", "λ", "μ", 
				"ν", "ξ", "ο", "ό", "π", "ρ", "σ", "τ", "υ", "ύ", "ϋ", "ΰ", "φ", "χ", "ψ", "ω", "ώ", "ς",
				"Α", "Ά", "Β", "Γ", "Δ", "Ε", "Έ", "Ζ", "Η", "Ή", "Θ", "Ι", "Ί", "Ϊ", "Κ", "Λ", "Μ",
				"Ν", "Ξ", "Ο", "Ό", "Π", "Ρ", "Σ", "Τ", "Υ", "Ύ", "Φ", "Χ", "Ψ", "Ω", "Ώ", "Σ",
				" ", "\t", "/", "!", "@", "#", "$", "%", "^", "-"}, new String[]{
				"a", "a", "b", "g", "d", "e", "e", "z", "i", "i", "th", "i", "i", "i", "i", "k", "l", "m",
				"n", "ks", "o", "o", "p", "r", "s", "t", "y", "y", "y", "y", "f", "x", "ps", "o", "o", "s",
				"A", "A", "B", "G", "D", "E", "E", "Z", "I", "I", "TH", "I", "I", "I", "K", "L", "M",
				"N", "KS", "O", "O", "P", "R", "S", "T", "Y", "Y", "F", "X", "PS", "O", "O", "S",
				"_", "_", "_", "", "", "", "", "", "",  "_"});
	}
}
